Documents/Лео_ЗаявкаНаОбразцы/Лео_ЗаявкаНаОбразцы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Лео_ЗаявкаНаОбразцы</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыОтгрузки</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.абс_ХозяйственныеОперацииПУБ77</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаСписания</name>
    <type>
      <types>CatalogRef.ПричиныСписания</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>CatalogRef.Лео_ОснованиеСписания</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Паллет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортныхКоробов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОформлениеПриказаШапка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОформлениеПриказаПодвал</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияМест</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Бренды</name>
    <attributes>
      <name>Бренд</name>
      <type>
        <types>CatalogRef.Лео_Бренды</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяБюджета</name>
      <type>
        <types>CatalogRef.Лео_СтатьиОборотовРасшифровка</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СопряженныеДокументы</name>
    <attributes>
      <name>ЗаявкаНаОбразцы</name>
      <type>
        <types>DocumentRef.Лео_ЗаявкаНаОбразцы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

InformationRegisters/абс_СостоянияСогласованияДокументов/абс_СостоянияСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_СостоянияСогласованияДокументов</name>
  <comment>Состояния согласования документов</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияОбъектов</types>
    </type>
  </resources>
  <resources>
    <name>Уровень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Этап</name>
    <type>
      <types>CatalogRef.абс_МаршрутыСогласованияДокументов</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийЭтап</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументДляСогласования</name>
    <type>
      <types>DocumentRef.Лео_ЗаявкаНаАкцию</types>
      <types>DocumentRef.Лео_ЗаявкаНаОбразцы</types>
      <types>DocumentRef.Лео_ЗаявкаНаЗапчасти</types>
      <types>DocumentRef.СчетФактураПолученный</types>
      <types>DocumentRef.абс_ВводБюджета</types>
      <types>DocumentRef.абс_СтратегическиеЦелиПродаж</types>
      <types>DocumentRef.ЗаявкаНаРасходованиеСредств</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ПланПродаж</types>
      <types>DocumentRef.абс_ЗаявкаНаБюджетОтделаТМ</types>
      <types>DocumentRef.Лео_ФиксацияСкидокПоТрейдМаркетингу</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Enums/абс_СтатусыОтгрузки/абс_СтатусыОтгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыОтгрузки</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Подобран</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
  <enumValues>
    <name>ВПути</name>
  </enumValues>
  <enumValues>
    <name>Доставлен</name>
  </enumValues>
  <enumValues>
    <name>Аннулирован</name>
  </enumValues>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>КОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытаСборка</name>
  </enumValues>
</mdclass:Enum>

Enums/СостоянияОбъектов/СостоянияОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияОбъектов</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Подготовлен</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>Отложен</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
  <enumValues>
    <name>абс_Проведен</name>
    <comment>Оплачен</comment>
  </enumValues>
  <enumValues>
    <name>Лео_ОтправленНаДоработку</name>
  </enumValues>
  <enumValues>
    <name>Лео_КОплате</name>
  </enumValues>
  <enumValues>
    <name>Лео_Завершен</name>
  </enumValues>
  <enumValues>
    <name>Лео_Аннулирован</name>
  </enumValues>
  <enumValues>
    <name>Лео_ПроверенФакт</name>
  </enumValues>
</mdclass:Enum>

Catalogs/Лео_Бренды/Лео_Бренды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Лео_Бренды</name>
  <comment>Используюется в Бюджетировании</comment>
  <attributes>
    <name>СоответствиеБрендЗначенияСвойствОбъектов</name>
    <type>
      <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяБюджета</name>
    <type>
      <types>CatalogRef.Лео_СтатьиОборотовРасшифровка</types>
    </type>
  </attributes>
</mdclass:Catalog>

Documents/Лео_ЗаявкаНаОбразцы/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура СоздатьСписаниеТоваров(Команда)
	Если Объект.Проведен тогда
		Если НЕ Объект.Статус = Перечисления.абс_СтатусыОтгрузки.КОтгрузке тогда
			Сообщить("Создания документа ""Списание товаров"" возможно только из статуса ""К отгрузке""");
			Возврат;
		КонецЕсли;
		
		Парам = новый Структура; 
		Парам.Вставить("Основание",Объект.Ссылка);
		ОткрытьФорму("Документ.СписаниеТоваров.Форма.ФормаДокумента",Парам);
	Иначе
		Сообщить ("Документ не проведен");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	ЗаполнитьТабличнуюЧастьТовары(Истина) ;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТабличнуюЧастьТовары(ОчищатьТабличнуюЧасть = Истина) Экспорт
	
	Если ОчищатьТабличнуюЧасть Тогда
		Если Объект.Товары.Количество()>0 Тогда
			Если Вопрос("Перед заполнением табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				Объект.Товары.Очистить();
			Иначе
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Файл Excel|*.xls*";
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Заголовок = "Выберите файл загрузки";
	Если Не Диалог.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	ФайлEXCEL = Диалог.ВыбранныеФайлы[0];
	
	ТабЗнач = ЗагрузитьМетодом_ExcelApplication(ФайлEXCEL, Ложь, 26);
	
	ЗаполнитьТабличнуюЧастьЗаказа( ТабЗнач ,ОчищатьТабличнуюЧасть);
	
КонецПроцедуры

&НаКлиенте
Функция ЗагрузитьМетодом_ExcelApplication(Знач ИмяФайла, ПерваяСтрокаЗаголовки = Истина, НачалоСтрокДанных = 26)
	
	Перем оЕ, Книга, Лист;                  
	
	// создаем объект Excel
	Попытка
		оЕ = Новый COMОбъект("Excel.Application");
	Исключение
		Сообщить("Ошибка запуска Excel!");
		оЕ = Неопределено;
		Возврат Неопределено;
	КонецПопытки;
	
	// открываем файл
	Попытка
		Книга = оЕ.Workbooks.Open(ИмяФайла);
	Исключение
		Сообщить("Ошибка открытия файла "+ИмяФайла+"!");
		Книга = Неопределено;
		оЕ.Quit();
		оЕ = Неопределено;
		Возврат Неопределено;
	КонецПопытки;
	
	// получаем данные листа 1
	Попытка
		Лист = Книга.Worksheets(1);
		//КоличествоСтрок = Лист.Cells(1,1).SpecialCells(11).Row;
		КоличествоСтрок = 200;

		КоличествоКолонок = Лист.Cells(1,1).SpecialCells(11).Column;
		
		ТаблицаРезультат = Новый ТаблицаЗначений;
		Для Сч = 1 По КоличествоКолонок Цикл
			Если ПерваяСтрокаЗаголовки Тогда
				Колонка = ТаблицаРезультат.Колонки.Добавить(Строка(Лист.Cells(НачалоСтрокДанных-1,Сч).Value));
				Колонка.Заголовок = Строка(Лист.Cells(НачалоСтрокДанных-1,Сч).Value);
			Иначе
				Колонка = ТаблицаРезультат.Колонки.Добавить("Колонка"+СтрЗаменить(Строка(Сч),Символы.НПП,""));
			КонецЕсли;
		КонецЦикла;
		
		ПерваяСтрока = НачалоСтрокДанных;
		
		МассивДанных = Лист.Range(Лист.Cells(ПерваяСтрока,1),Лист.Cells(КоличествоСтрок,КоличествоКолонок)).Value.Unload();
		
		Лист = Неопределено;
		Книга = Неопределено;
		оЕ.Quit();
		оЕ = Неопределено;
		
		Для Сч = ПерваяСтрока По КоличествоСтрок Цикл
			ТаблицаРезультат.Добавить();
		КонецЦикла;
		
		Для Сч = 0 По КоличествоКолонок-1 Цикл
			ТаблицаРезультат.ЗагрузитьКолонку(МассивДанных[Сч],Сч);
		КонецЦикла;
		
		Возврат ТаблицаРезультат;
	Исключение
		Сообщить("Ошибка загрузки данных!");
		Лист = Неопределено;
		Книга = Неопределено;
		оЕ.Quit();
		оЕ = Неопределено;
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТабличнуюЧастьЗаказа( ТабЗнач ,ОчищатьТабличнуюЧасть);

	Для каждого СтрокаТЧ из ТабЗнач цикл
		Артикул = СокрЛП(СтрЗаменить(Строка(СтрокаТЧ.Колонка10)," ",""));
		Если НЕ Артикул = "" Тогда 
			Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",Артикул);
			Если Не Номенклатура = Справочники.Номенклатура.ПустаяСсылка()Тогда
				НоваяСтрока = Объект.Товары.Добавить();
				НоваяСтрока.Номенклатура 	= Номенклатура;
				НоваяСтрока.Количество 		= Число(СтрокаТЧ.Колонка14);
				НоваяСтрока.Цена			= ПолучитьЦену(Номенклатура);
				НоваяСтрока.Сумма			= НоваяСтрока.Количество * НоваяСтрока.Цена;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЦену (Номенклатура);
	
	
	Цена = Ценообразование.ПолучитьЦенуНоменклатуры(Номенклатура,,Объект.ТипЦен, Объект.Дата,,, 1, 1);

	//Рассчитывается = Объект.ТипЦен.Рассчитывается;
	//
	//Если Рассчитывается Тогда 
	//	БазовыйТипЦен	= Объект.ТипЦен.БазовыйТипЦен;
	//Иначе
	//	БазовыйТипЦен   = Объект.ТипЦен;
	//КонецЕсли;	
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ ПЕРВЫЕ 1
	//	|	ЦеныНоменклатурыСрезПоследних.Цена
	//	|ИЗ
	//	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	//	|			,
	//	|			ТипЦен = &ТипЦен
	//	|				И Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних";

	//Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	//Запрос.УстановитьПараметр("ТипЦен", БазовыйТипЦен);

	//Результат = Запрос.Выполнить();

	//ВыборкаДетальныеЗаписи = Результат.Выбрать();

	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	Цена = ВыборкаДетальныеЗаписи.Цена;
	//КонецЦикла;

	Возврат Цена	
	
КонецФункции

&НаКлиенте
Процедура ТипЦенПриИзменении(Элемент)
	 ЗаполнитьЦеныТабличнуюЧасть( );
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦеныТабличнуюЧасть( );
    СуммаДок = 0;
	Для каждого СтрокаТЧ из Объект.Товары цикл
		СтрокаТЧ.Цена			= ПолучитьЦену(СтрокаТЧ.Номенклатура);
		СтрокаТЧ.Сумма			= СтрокаТЧ.Количество * СтрокаТЧ.Цена;
		СуммаДок = СуммаДок+СтрокаТЧ.Сумма; 
	КонецЦикла;
	Объект.СуммаДокумента = СуммаДок;	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	ОбновитьДанныеПоТЧ ();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПоТЧ ()
	СуммаТЧ = 0;
	Для каждого СтрокаТч из  Объект.Товары цикл
		СуммаТЧ = СуммаТЧ + СтрокаТЧ.Сумма;	
	КонецЦикла;
	Объект.СуммаДокумента = СуммаТЧ;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	//ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(Элементы.Товары.ТекущиеДанные, Объект);
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	Если Не ТекущаяСтрока = Неопределено Тогда
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.ЕдиницаИзмерения) И ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Для " + СокрЛП(ТекущаяСтрока.Номенклатура) + " не выбрана единица измерения цены!
				                 |Пересчет количества невозможен.");
		
		ИначеЕсли НЕ ЗначениеЗаполнено(ТекущаяСтрока.ЕдиницаИзмеренияМест) Тогда
			ТекущаяСтрока.КоличествоМест = 0;
		Иначе
			Если ТекущаяСтрока.Коэффициент = 0 И ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
					ОбщегоНазначения.СообщитьОбОшибке("Для " + СокрЛП(ТекущаяСтрока.Номенклатура) + " у единицы измерения цены "
					                 + СокрЛП(ТекущаяСтрока.ЕдиницаИзмерения) + " не проставлен коэффициент!
					                 |Пересчет количества невозможен.");
			ИначеЕсли ТекущаяСтрока.ЕдиницаИзмеренияМест.Коэффициент = 0 И ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Для " + СокрЛП(ТекущаяСтрока.Номенклатура) + " у единицы измерения мест "
					                 + СокрЛП(ТекущаяСтрока.ЕдиницаИзмеренияМест) + " не проставлен коэффициент!
					                 |Пересчет количества невозможен.");
			Иначе
				//Расчет количества в единицах измерения мест - КоличествоМест				 
                ЕдиницаИзмеренияМест = ТекущаяСтрока.ЕдиницаИзмеренияМест;
				Если ТекущаяСтрока.ЕдиницаИзмерения = ЕдиницаИзмеренияМест Тогда
					КоличествоМест = ТекущаяСтрока.Количество;
				Иначе
					КоличествоМест = ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент / ТекущаяСтрока.ЕдиницаИзмеренияМест.Коэффициент;
				КонецЕсли;
				
				//Если Цел(КоличествоМест)<>КоличествоМест Тогда	
				//	СтрокаТабличнойЧасти.КоличествоМест = КоличествоМест;
				//КонецЕсли;
				ТекущаяСтрока.КоличествоМест = КоличествоМест;
			КонецЕсли;
		КонецЕсли;
	ПересчитатьСумму ();	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияМестПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
		ТекущаяСтрока.ЕдиницаИзмерения = ТекущаяСтрока.Номенклатура.ЕдиницаХраненияОстатков;
		ТекущаяСтрока.Коэффициент      = ТекущаяСтрока.ЕдиницаИзмерения.Коэффициент;
		ТекущаяСтрока.ЕдиницаИзмеренияМест = ТекущаяСтрока.Номенклатура.ЕдиницаИзмеренияМест;
		Если ЗначениеЗаполнено(Объект.ТипЦен) Тогда
			ТекущаяСтрока.Цена = Ценообразование.ПолучитьЦенуНоменклатуры(ТекущаяСтрока.Номенклатура,,Объект.ТипЦен, Объект.Дата,,, 1, 1);
        КонецЕсли;
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ПересчитатьСумму ();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСумму ()
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.количество * ТекущаяСтрока.Цена;
КонецПроцедуры	

&НаКлиенте
Процедура СоздатьПеремещениеТоваров(Команда)
	Если Объект.Проведен тогда
		Если НЕ Объект.Статус = Перечисления.абс_СтатусыОтгрузки.КОтгрузке тогда
			Сообщить("Создания документа ""Списание товаров"" возможно только из статуса ""К отгрузке""");
			Возврат;
		КонецЕсли;
		
		Парам = новый Структура; 
		Парам.Вставить("Основание",Объект.Ссылка);
		ОткрытьФорму("Документ.ПеремещениеТоваров.Форма.ФормаДокумента",Парам);
	Иначе
		Сообщить ("Документ не проведен");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОприходованиеТоваров(Команда)
		Если Объект.Проведен тогда
		Если НЕ Объект.Статус = Перечисления.абс_СтатусыОтгрузки.КОтгрузке тогда
			Сообщить("Создания документа ""Оприходование товаров"" возможно только из статуса ""К отгрузке""");
			Возврат;
		КонецЕсли;
		
		Парам = новый Структура; 
		Парам.Вставить("Основание",Объект.Ссылка);
		ОткрытьФорму("Документ.ОприходованиеТоваров.Форма.ФормаДокумента",Парам);
	Иначе
		Сообщить ("Документ не проведен");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Группа1ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	// Вставить содержимое обработчика.
	Если Элемент.ТекущаяСтраница.Имя="СтраницаСогласования" Тогда
		ИсторияСогласования.Параметры.УстановитьЗначениеПараметра("ДокументДляСогласования", Объект.Ссылка);
	КонецЕсли;
	//ПриСозданииНаСервере(Ложь, Истина);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
	ИсторияСогласования.Параметры.УстановитьЗначениеПараметра("ДокументДляСогласования", Объект.Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура Согласовать(Команда)
	ИзменитьСостояниеДокумента(Перечисления.СостоянияОбъектов.Согласован);
КонецПроцедуры

&НаСервере
Функция НайтиПоСоответствию(Номенклатура)
	Запрос	=	Новый Запрос;
	Запрос.Текст	=	"ВЫБРАТЬ
	            	 	|	БрендНоменклатуры.Значение,
	            	 	|	Лео_Бренды.СтатьяБюджета КАК СтатьяБюджета,
	            	 	|	Лео_Бренды.Ссылка КАК Ссылка
	            	 	|ИЗ
	            	 	|	(ВЫБРАТЬ
	            	 	|		ЗначенияСвойствОбъектов.Объект КАК Объект,
	            	 	|		ЗначенияСвойствОбъектов.Свойство КАК Свойство,
	            	 	|		ЗначенияСвойствОбъектов.Значение КАК Значение
	            	 	|	ИЗ
	            	 	|		РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	            	 	|	ГДЕ
	            	 	|		ЗначенияСвойствОбъектов.Свойство = &Свойство
	            	 	|		И ЗначенияСвойствОбъектов.Объект = &Номенклатура) КАК БрендНоменклатуры
	            	 	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Лео_Бренды КАК Лео_Бренды
	            	 	|		ПО БрендНоменклатуры.Значение = Лео_Бренды.СоответствиеБрендЗначенияСвойствОбъектов";
	Запрос.УстановитьПараметр("Свойство",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00000000301"));					
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Выборка	=	Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;	
	Возврат Справочники.Лео_Бренды.ПустаяСсылка();
КонецФункции

&НаСервере
Процедура СвернутьТаблицу()
	ТабЗначений	=	Новый ТаблицаЗначений;
	ТабЗначений	= Объект.Бренды.Выгрузить();
	ТабЗначений.Свернуть("Бренд, СтатьяБюджета","Сумма");
	Объект.Бренды.Загрузить(ТабЗначений);
	
КонецПроцедуры	

&НаКлиенте
Процедура РаспределитьПоБрендам_Бюджетам()
	Объект.Бренды.Очистить();
	Для Каждого СтрокаТовары Из Объект.Товары Цикл
		Бренд_Лео	=	НайтиПоСоответствию(СтрокаТовары.Номенклатура);	
		СтрокаБреды	=	Объект.Бренды.Добавить();
		СтрокаБреды.Бренд			=	Бренд_Лео.Ссылка;	
		СтрокаБреды.Сумма			=	СтрокаТовары.Сумма;	
		СтрокаБреды.СтатьяБюджета	=	Бренд_Лео.СтатьяБюджета;	
	КонецЦикла;
	СвернутьТаблицу();
КонецПроцедуры	

&НаКлиенте
Процедура Отклонить(Команда)
	ИзменитьСостояниеДокумента(Перечисления.СостоянияОбъектов.Отклонен);
КонецПроцедуры

&НаКлиенте
Процедура Отложить(Команда)
	ИзменитьСостояниеДокумента(Перечисления.СостоянияОбъектов.Отложен);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСостояниеДокумента(НовоеСостояние)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Или ЭтаФорма.Модифицированность Тогда
		Если Вопрос("Перед изменением состояния документ необходимо записать. Записать?", РежимДиалогаВопрос.ДаНет)	= КодВозвратаДиалога.Да Тогда
			Записать();
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	ПараметрыФормы = абс_СогласованиеДокументов.ПолучитьПараметрыДляСогласованияДокумента(Объект.Ссылка, НовоеСостояние, ПараметрыСеанса.ТекущийПользователь);
	Если ПараметрыФормы = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ не требует согласования пользователем " + ПараметрыСеанса.ТекущийПользователь);
	Иначе
		ОткрытьФорму("Обработка.абс_СогласованиеДокументов.Форма.ИзменениеСостоянияДокументов", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если НЕ ЗначениеЗаполнено(Объект.Состояние) Тогда
		Объект.Состояние=Перечисления.СостоянияОбъектов.Подготовлен;
	КонецЕсли;
	Если Объект.Бренды.Количество()=0 Тогда
		РаспределитьПоБрендам_Бюджетам();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьКнопка(Команда)
	// Вставить содержимое обработчика.
	//ДокументОбъект = РеквизитФормыВЗначение("Объект");
	//ДокументОбъект.Печать("БланкЗаявки");
	Печать("БланкЗаявки");
КонецПроцедуры

&НаСервере
Функция ПолучитьМакетНаСервере()
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	Макет = ОтчетОбъект.ПолучитьМакет("БланкЗаявки");
	Возврат Макет;
КонецФункции

&НаСервере
Функция ПечатьБланкЗаявки()
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РеализацияТоваровУслуг_Акт";
	Макет       	= Документы.Лео_ЗаявкаНаОбразцы.ПолучитьМакет("БланкЗаявки");
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.НомерДок	 			= Объект.Номер;
	ОбластьМакета.Параметры.Организация 			= Объект.Организация.НаименованиеПолное;
	ОбластьМакета.Параметры.Подразделение 			= Объект.Подразделение.Наименование;
	ОбластьМакета.Параметры.КодЦФО 					= Объект.Подразделение.Код;
	ОбластьМакета.Параметры.Ответственный 			= Объект.Ответственный.Наименование;
	ОбластьМакета.Параметры.ДатаСоставления 		= Формат(Объект.Дата,"ДЛФ=Д");
	ОбластьМакета.Параметры.ДатаОтгрузки 			= Формат(Объект.ДатаОтгрузки,"ДЛФ=Д");
	ОбластьМакета.Параметры.Получатель	 			= Объект.Контрагент.Наименование;
	ОбластьМакета.Параметры.ХозОперация 			= Объект.ХозяйственнаяОперация.Наименование;
	ОбластьМакета.Параметры.Основание	 			= Объект.Основание.Наименование;
	ОбластьМакета.Параметры.КомментарийДокумента	= Объект.Комментарий;
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	ОписаниеВеса  = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 2));
	//ТЗБренд 	  =	Новый ТаблицаЗначений;
	//ТЗБренд.Колонки.Добавить("Бренд");
	//ТЗБренд.Колонки.Добавить("Сумма", ОписаниеВеса, "Сумма");
	//ТЗБренд.Колонки.Добавить("СтатьяБюджета");
	
	Для Каждого СтрокаТЗ Из Объект.Товары Цикл
		//Заполняем макет
		ОбластьМакета.Параметры.Номер 			= СтрокаТЗ.НомерСтроки;
		ОбластьМакета.Параметры.PRБренд 		= лео_ДопФункции.Получить_ЗначенияСвойствОбъектов(СтрокаТЗ.Номенклатура,ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00000000301"));
		ОбластьМакета.Параметры.Артикул 		= СтрокаТЗ.Номенклатура.Артикул;
		ОбластьМакета.Параметры.Номенклатура 	= СтрокаТЗ.Номенклатура.Наименование;
		ОбластьМакета.Параметры.СерияНом 		= СтрокаТЗ.СерияНоменклатуры.Наименование;
		ОбластьМакета.Параметры.КолВо 			= СтрокаТЗ.Количество;
		ОбластьМакета.Параметры.КолВоУпак 		= СтрокаТЗ.КоличествоМест;
		ОбластьМакета.Параметры.ЦенаБезНДС	 	= СтрокаТЗ.Цена;
		ОбластьМакета.Параметры.Сумма		 	= СтрокаТЗ.Сумма;
		ТабДокумент.Вывести(ОбластьМакета);
		
		//заполняем таблицу брендов
		//Стр	=	ТЗБренд.Добавить();
		//Стр.Бренд 			=	лео_ДопФункции.Получить_ЗначенияСвойствОбъектов(СтрокаТЗ.Номенклатура,ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00000000301"));	
		//Стр.Сумма 			=	СтрокаТЗ.Сумма;	
		//Стр.СтатьяБюджета 	=	"-";	
		
	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакета.Параметры.ИтогоКолВо			= Объект.Товары.Итог("Количество");
	ОбластьМакета.Параметры.ИтогоКолВоУпак		= Объект.Товары.Итог("КоличествоМест");
	ОбластьМакета.Параметры.ИтогоСумма			= Объект.Товары.Итог("Сумма");
	ТабДокумент.Вывести(ОбластьМакета);
	
	//ТЗБренд.Свернуть("Бренд, СтатьяБюджета","Сумма");
	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаБренд");
	
	Для Каждого СтрокаТЗ Из Объект.Бренды Цикл
		ОбластьМакета.Параметры.PRБренд			= СтрокаТЗ.Бренд;
		ОбластьМакета.Параметры.Сумма			= СтрокаТЗ.Сумма;
		ОбластьМакета.Параметры.СтатьяБюджета	= СтрокаТЗ.СтатьяБюджета.абс_КодБюджетнойСтатьи;
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("ИтогоБренд");
	ОбластьМакета.Параметры.ИтогоСумма			= Объект.Бренды.Итог("Сумма");
	ТабДокумент.Вывести(ОбластьМакета);
	
	Запрос	= Новый Запрос;
	Запрос.Текст	=	"ВЫБРАТЬ
	            	 	|	РегистрСведенийабс_СостоянияСогласованияДокументов.Период КАК Период,
	            	 	|	РегистрСведенийабс_СостоянияСогласованияДокументов.ДокументДляСогласования,
	            	 	|	РегистрСведенийабс_СостоянияСогласованияДокументов.Пользователь,
	            	 	|	РегистрСведенийабс_СостоянияСогласованияДокументов.Состояние,
	            	 	|	РегистрСведенийабс_СостоянияСогласованияДокументов.Уровень,
	            	 	|	РегистрСведенийабс_СостоянияСогласованияДокументов.Этап,
	            	 	|	РегистрСведенийабс_СостоянияСогласованияДокументов.Комментарий,
	            	 	|	РегистрСведенийабс_СостоянияСогласованияДокументов.ТекущийЭтап
	            	 	|ИЗ
	            	 	|	РегистрСведений.абс_СостоянияСогласованияДокументов КАК РегистрСведенийабс_СостоянияСогласованияДокументов
	            	 	|ГДЕ
	            	 	|	РегистрСведенийабс_СостоянияСогласованияДокументов.ДокументДляСогласования = &ДокументДляСогласования
	            	 	|
	            	 	|УПОРЯДОЧИТЬ ПО
	            	 	|	Период";
	Запрос.УстановитьПараметр("ДокументДляСогласования",Объект.Ссылка);
	Выборка	=	Запрос.Выполнить().Выбрать();
	ОбластьМакета = Макет.ПолучитьОбласть("ПодписиСогласование");
	
	Пока Выборка.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(Выборка.ТекущийЭтап) Тогда
			Продолжить;
		КонецЕсли;
		ОбластьМакета.Параметры.ПодписиЭтап			= Выборка.ТекущийЭтап;
		ОбластьМакета.Параметры.ПодписиСостояние	= Выборка.Состояние;
		ОбластьМакета.Параметры.ПодписиПользователь	= Выборка.Пользователь;
		ТабДокумент.Вывести(ОбластьМакета);
		
	КонецЦикла;

	Возврат ТабДокумент;

КонецФункции

&НаКлиенте
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

	//Если ЭтаФорма.Модифицированность Тогда
	//	Предупреждение("Документ можно распечатать только после его записи");
	//	Возврат;
	//КонецЕсли;
	//
	//Если Не РаботаСДиалогами.ПроверитьМодифицированность(Объект) Тогда
	//	Возврат;
	//КонецЕсли;
	
	// Получить экземпляр документа на печать
	Если ИмяМакета = "БланкЗаявки" Тогда
		ТабДокумент = ПечатьБланкЗаявки();
		//ТабДокумент.Показать("Бланк заказа на образцы");
	ИначеЕсли ИмяМакета = "Приказ" Тогда
		ТабДокумент = ПечатьПриказ();
	ИначеЕсли ИмяМакета = "НаСборку" Тогда
		ТабДокумент = ПечатьНаСборку();
	Иначе
		Возврат;
	КонецЕсли;
	
	
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, "Служебная записка на образцы продукции", Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьБренды(Команда)
	// Вставить содержимое обработчика.
	РаспределитьПоБрендам_Бюджетам();
КонецПроцедуры

&НаКлиенте
Процедура Приказ(Команда)
	// Вставить содержимое обработчика.
	Печать("Приказ");
КонецПроцедуры

&НаСервере
Функция ПечатьПриказ()
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПРИКАЗ";
	Макет       	= Документы.Лео_ЗаявкаНаОбразцы.ПолучитьМакет("ПРИКАЗ");
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаПриказа");
	ОбластьМакета.Параметры.НаименованиеОрганизации		= Объект.Организация.Наименование;
	ОбластьМакета.Параметры.ДатаДокумента				= Формат(Объект.Дата, "ДЛФ=Д");
	ОбластьМакета.Параметры.ДокументКомментарии			= СокрЛП(Объект.Комментарий);
	ОбластьМакета.Параметры.ОформлениеПриказаШапка		= Объект.ОформлениеПриказаШапка;
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ТаблицаШапка");                                       
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ТаблицаСтрока");                                       
	НомерСтрокиПорядок	=	0;
	Для Каждого СтрокаТЗ Из Объект.Товары Цикл
		//Заполняем макет
		НомерСтрокиПорядок	=	НомерСтрокиПорядок+1;
		ОбластьМакета.Параметры.Номер 			= НомерСтрокиПорядок;
		ОбластьМакета.Параметры.Артикул 		= СтрокаТЗ.Номенклатура.Артикул;
		ОбластьМакета.Параметры.Наименование 	= СтрокаТЗ.Номенклатура.Наименование;
		ОбластьМакета.Параметры.КолВо 			= СтрокаТЗ.Количество;
		ОбластьМакета.Параметры.ЕдИзм		 	= СтрокаТЗ.ЕдиницаИзмерения;
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;  
	
	//если есть сопряженные документы тодобавим строки в табличную часть 
	Если Не Объект.СопряженныеДокументы.Количество()=0 Тогда
		Для Каждого СтрокаСопряженныыйДокумент Из Объект.СопряженныеДокументы Цикл
			СопряженныйДок	=	СтрокаСопряженныыйДокумент.ЗаявкаНаОбразцы;
			Для каждого СтрокаТЗ Из СопряженныйДок.Товары Цикл
				//Заполняем макет
				НомерСтрокиПорядок	=	НомерСтрокиПорядок+1;
				ОбластьМакета.Параметры.Номер 			= НомерСтрокиПорядок;
				ОбластьМакета.Параметры.Артикул 		= СтрокаТЗ.Номенклатура.Артикул;
				ОбластьМакета.Параметры.Наименование 	= СтрокаТЗ.Номенклатура.Наименование;
				ОбластьМакета.Параметры.КолВо 			= СтрокаТЗ.Количество;
				ОбластьМакета.Параметры.ЕдИзм		 	= СтрокаТЗ.ЕдиницаИзмерения;
				ТабДокумент.Вывести(ОбластьМакета);
		    КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	ОбластьМакета = Макет.ПолучитьОбласть("ПодвалПриказ");
	Если Объект.СопряженныеДокументы.Количество()=0 Тогда
		ИтогоКоличество	= Объект.Товары.Итог("Количество");
	Иначе
		ИтогоКоличество	= Объект.Товары.Итог("Количество");
		Для Каждого СтрокаСопряженныыйДокумент Из Объект.СопряженныеДокументы Цикл
			ИтогоКоличество	=	ИтогоКоличество+СтрокаСопряженныыйДокумент.ЗаявкаНаОбразцы.Товары.Итог("Количество");	
		КонецЦикла; 
	КонецЕсли;
	ОбластьМакета.Параметры.ИтогоКолВо					= ИтогоКоличество;
	ОбластьМакета.Параметры.ОформлениеПриказаПодвал		= Объект.ОформлениеПриказаПодвал;
	ОбластьМакета.Параметры.ДатаДокумента				= Объект.Дата;
	//ТабДокумент.Вывести(ОбластьМакета);
	//
	////ТЗБренд.Свернуть("Бренд, СтатьяБюджета","Сумма");
	//ОбластьМакета = Макет.ПолучитьОбласть("СтрокаБренд");
	//
	//Для Каждого СтрокаТЗ Из Объект.Бренды Цикл
	//	ОбластьМакета.Параметры.PRБренд			= СтрокаТЗ.Бренд;
	//	ОбластьМакета.Параметры.Сумма			= СтрокаТЗ.Сумма;
	//	ОбластьМакета.Параметры.СтатьяБюджета	= СтрокаТЗ.СтатьяБюджета.абс_КодБюджетнойСтатьи;
	//	ТабДокумент.Вывести(ОбластьМакета);
	//КонецЦикла;
	//
	//ОбластьМакета = Макет.ПолучитьОбласть("ИтогоБренд");
	//ОбластьМакета.Параметры.ИтогоСумма			= Объект.Бренды.Итог("Сумма");
	//ТабДокумент.Вывести(ОбластьМакета);
	//
	//ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
	ТабДокумент.Вывести(ОбластьМакета);

	Возврат ТабДокумент;

КонецФункции

&НаКлиенте
Процедура НаСборку(Команда)
	// Вставить содержимое обработчика.
	Печать("НаСборку");
	
КонецПроцедуры

&НаСервере
Функция ПечатьНаСборку()
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_НакладнаяНаСборку";
	Макет       	= Документы.Лео_ЗаявкаНаОбразцы.ПолучитьМакет("НакладнаяНаСборку");
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.НомерДокумента		= ""+СокрЛП(Объект.Номер)+" от "+Формат(Объект.Дата,"ДЛФ=ДД");
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	Для Каждого СтрокаТЗ Из Объект.Товары Цикл
		//Заполняем макет
		ОбластьМакета.Параметры.Номер 			= СтрокаТЗ.НомерСтроки;
		ОбластьМакета.Параметры.Артикул 		= СтрокаТЗ.Номенклатура.Артикул;
		ОбластьМакета.Параметры.Наименование 	= СтрокаТЗ.Номенклатура.Наименование;
		ОбластьМакета.Параметры.Серия 			= СтрокаТЗ.СерияНоменклатуры;
		ОбластьМакета.Параметры.КолВо 			= СтрокаТЗ.Количество;
		ОбластьМакета.Параметры.ЕдИзм		 	= СтрокаТЗ.ЕдиницаИзмерения;
		ОбластьМакета.Параметры.Подразделение 	= Объект.Подразделение;
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции	
//&НаКлиенте
//Функция ВывестиПредупреждение(ТекстПредупреждения)
//	Предупреждение(ТекстПредупреждения);
//КонецФункции
